var footerMenuData=[
    {"id":1,"name":"质量地图","url":"indexPage","icon":"iconNew-listmap"},
    {"id":2,"name":"测管协同","url":"auditPage","icon":"iconNew-listList"},
    {"id":3,"name":"审核数据","url":"dataAuditPage","icon":"iconNew-listcity"},
    {"id":4,"name":"数据统计","url":"cityRankPage","icon":"iconNew-listRank"},
    {"id":5,"name":"空气预报","url":"forePubPage","icon":"iconNew-listFore"}
];
var cityMapDetail=[
    {"cityCode":"5101","cityName":"成都","point":"104.06|30.67","area":"盆地西部","zoom":"11","cityPoint":"104.06|30.67"},
    {"cityCode":"5103","cityName":"自贡","point":"104.78|29.35","area":"盆地南部","zoom":"13","cityPoint":"104.78|29.35"},
    {"cityCode":"5104","cityName":"攀枝花","point":"101.72|26.58","area":"攀西高原","zoom":"11","cityPoint":"101.70|26.52"},
    {"cityCode":"5105","cityName":"泸州","point":"105.43|28.87","area":"盆地南部","zoom":"11","cityPoint":"105.43|28.87"},
    {"cityCode":"5106","cityName":"德阳","point":"104.38|31.13","area":"盆地西部","zoom":"13","cityPoint":"104.39|31.12"},
    {"cityCode":"5107","cityName":"绵阳","point":"104.73|31.47","area":"盆地西部","zoom":"11","cityPoint":"104.73|31.47"},
    {"cityCode":"5108","cityName":"广元","point":"105.83|32.43","area":"盆地东北部","zoom":"12","cityPoint":"105.85|32.43"},
    {"cityCode":"5109","cityName":"遂宁","point":"105.57|30.52","area":"盆地东北部","zoom":"12","cityPoint":"105.57|30.52"},
    {"cityCode":"5110","cityName":"内江","point":"105.05|29.58","area":"盆地南部","zoom":"13","cityPoint":"105.06|29.59"},
    {"cityCode":"5111","cityName":"乐山","point":"103.77|29.57","area":"盆地西部","zoom":"12","cityPoint":"103.77|29.56"},
    {"cityCode":"5113","cityName":"南充","point":"106.08|30.78","area":"盆地东北部","zoom":"12","cityPoint":"106.08|30.79"},
    {"cityCode":"5114","cityName":"眉山","point":"103.83|30.05","area":"盆地西部","zoom":"12","cityPoint":"103.85|30.05"},
    {"cityCode":"5115","cityName":"宜宾","point":"104.62|28.77","area":"盆地南部","zoom":"12","cityPoint":"104.62|28.75"},
    {"cityCode":"5116","cityName":"广安","point":"106.63|30.47","area":"盆地东北部","zoom":"12","cityPoint":"106.63|30.48"},
    {"cityCode":"5117","cityName":"达州","point":"107.50|31.22","area":"盆地东北部","zoom":"12","cityPoint":"107.50|31.23"},
    {"cityCode":"5118","cityName":"雅安","point":"103.00|29.98","area":"盆地西部","zoom":"13","cityPoint":"103.00|29.99"},
    {"cityCode":"5119","cityName":"巴中","point":"106.77|31.85","area":"盆地东北部","zoom":"13","cityPoint":"106.75|31.85"},
    {"cityCode":"5120","cityName":"资阳","point":"104.65|30.12","area":"盆地西部","zoom":"13","cityPoint":"104.65|30.13"},
    {"cityCode":"5132","cityName":"马尔康","point":"102.22|31.90","area":"川西高原","zoom":"12","cityPoint":"102.22|31.90"},
    {"cityCode":"5133","cityName":"康定","point":"101.97|30.05","area":"川西高原","zoom":"14","cityPoint":"101.965|30.05"},
    {"cityCode":"5134","cityName":"西昌","point":"102.27|27.90","area":"攀西高原","zoom":"12","cityPoint":"102.27|27.85"}
]
var riverMapDetail=[{},]
var levelColor=[
    {"type":"离线","level":"0","color":"#A7A7A7"},
    {"type":"优","level":"1","color":"#00E400"},
    {"type":"良","level":"2","color":"#fdc61e"},
    {"type":"轻度","level":"3","color":"#FF7E00"},
    {"type":"中度","level":"4","color":"#FF0000"},
    {"type":"重度","level":"5","color":"#99004C"},
    {"type":"严重","level":"6","color":"#7E0023"}
]
var weekday=new Array(7);
weekday[0]="星期天";
weekday[1]="星期一";
weekday[2]="星期二";
weekday[3]="星期三";
weekday[4]="星期四";
weekday[5]="星期五";
weekday[6]="星期六";

var littleTips=[
    {"name":"优","level":"1","content":"空气质量级别为一级，空气质量状况属于优。此时，空气质量令人满意，基本无空气污染，各类人群可正常活动。"},
    {"name":"良","level":"2","content":"空气质量级别为二级，空气质量状况属于良。此时，空气质量可接受，但某些污染物可能对极少数异常敏感人群健康有较弱影响，极少数异常敏感人群应减少户外活动。"},
    {"name":"轻度污染","level":"3","content":"空气质量级别为三级，空气质量状况属于轻度污染。此时，易感人群症状有轻度加剧，健康人群出现刺激症状，儿童、老年人及心脏病、呼吸系统疾病患者应减少长时间、高强度的户外锻炼。"},
    {"name":"中度污染","level":"4","content":"空气质量级别为四级，空气质量状况属于中度污染。此时，进一步加剧易感人群症状，可能对健康人群心脏、呼吸系统有影响，儿童、老年人及心脏病、呼吸系统疾病患者避免长时间、高强度的户外锻炼，一般人群适量减少户外运动。"},
    {"name":"重度污染","level":"5","content":"空气质量级别为五级，空气质量状况属于重度污染。此时，心脏病和肺病患者症状显著加剧，运动耐受力降低，健康人群普遍出现症状，儿童、老年人及心脏病、肺病患者应停留在室内，停止户外运动，一般人群减少户外运动。"},
    {"name":"严重污染","level":"6","content":"空气质量级别为六级，空气质量状况属于严重污染。此时，健康人群运动耐受力降低，有明显强烈症状，提前出现某些疾病，儿童、老年人和病人应停留在室内，避免体力消耗，一般人群避免户外活动。"}
]

var gasDetail={
    "SO2":{"NAME":"二氧化硫SO<sub>2</sub>","RES":"二氧化硫是一种无色气体，带有刺鼻的气味。人为的二氧化硫主要来源是为家庭取暖、发电和机动车而燃烧含有硫磺的矿物燃料，以及对含有硫磺的矿物的冶炼。",
        "DW":"1小时均值(μg/m³)","level1":"0~150","level2":"151~500","level3":"501~650","level4":"651~800","level5":"801~1600","level6":">1600",
        "HEAL":"二氧化硫可影响呼吸系统和肺功能，并刺激眼睛。呼吸道的炎症导致咳嗽、粘液分泌、加重哮喘和慢性支气管炎并使人们更易患呼吸道感染。"},
    "NO2":{"NAME":"二氧化氮NO<sub>2</sub>","RES":"二氧化氮的主要来源是燃烧过程产生，例如供热、发电以及机动车和船舶的发动机。",
        "DW":"1小时均值(μg/m³)","level1":"0~100","level2":"101~200","level3":"201~700","level4":"701~1200","level5":"1201~2340","level6":">2340",
        "HEAL":"流行病学研究表明，哮喘儿童发生支气管炎症状的增多与长期接触二氧化氮有关。目前在欧洲和北美一些城市中肺功能减弱现象的增加也与目前测量(或观察到)的二氧化氮的浓度有关。短期浓度超过200微克/立方米时，它是一种引起呼吸道严重发炎的有毒气体。二氧化氮是硝酸盐气溶胶的主要来源，构成PM2.5和在紫外线下臭氧的主要成分。"},
    "CO":{"NAME":"一氧化碳CO","RES":"一氧化碳通常产生于在燃烧的过程中没有足够的氧气，主要来自于火山活动和对流层中的光化学反应。其人为主要来源是汽车、火车、轮船和飞机等内燃机排出的尾气，火力发电厂、钢铁厂、石油化工厂、水泥厂生产过程中产生的废气，以及自然和人为的火灾(如森林大火，燃烧秸秆)。",
        "DW":"1小时均值(mg/m³)","level1":"0~5","level2":"6~10","level3":"11~35","level4":"36~60","level5":"61~90","level6":">90",
        "HEAL":"一氧化碳是无色、无臭、无味气体，但吸入对人体有十分大的伤害。它会结合血红蛋白生成碳氧血红蛋白，碳氧血红蛋白不能提供氧气给身体组织。这种情况被称为血缺氧。浓度低至667ppm可能会导致高达50%人体的血红蛋白转换为羰合血红蛋白，可能会导致昏迷和死亡。暴露在一氧化碳中可能严重损害心脏和中枢神经系统，并产生后遗症。一氧化碳可能令孕妇胎儿产生严重的不良影响。最常见的一氧化碳中毒症状是头痛、恶心、呕吐、头晕、疲劳和虚弱的感觉，包括视网膜出血。"},
    "O3":{"NAME":"臭氧O<sub>3</sub>","RES":"与高层大气臭氧层不同的是，地面的臭氧是光化学烟雾的一个主要组成部分。它是由诸如车辆和工业释放出的氧化氮(NOx)等污染物以及由机动车、溶剂和工业释放的挥发性有机化合物(VOCs)与阳光反应而形成。阳光灿烂时，臭氧污染最为严重。",
        "DW":"1小时均值(μg/m³)","level1":"0~100","level2":"101~160","level3":"161~215","level4":"216~265","level5":"266~800","level6":">800",
        "HEAL":"空气中过多的臭氧对人类健康造成显著影响。它可导致呼吸问题、引发哮喘、降低肺功能并引起肺部疾病。目前它是欧洲最为令人关切的空气污染物之一。若干项欧洲研究报告称，对臭氧的暴露每增加10微克/立方米，日死亡率上升0.3%，心脏病增加0.4%。在空气中二氧化硫水平较高的日子里，因心脏病去医院就诊的人增多，死亡率增长。当二氧化硫与水结合时形成硫酸；这是酸雨的主要成分，是造成树木死亡的一个原因。"},
    "PM2_5":{"NAME":"细颗粒物PM<sub>2.5</sub>","RES":"细颗粒物的主要来源是燃料、木材和其它生物质燃料的燃烧。它的主要组成成分是硫酸盐、硝酸盐、氨、氯化钠、黑碳、矿物粉尘和水。它包括悬浮在空气中的有机和无机物的固体和液体复杂混合物。",
        "DW":"24小时均值(μg/m³)","level1":"0~35","level2":"36~75","level3":"76~115","level4":"116~150","level5":"151~250","level6":">250",
        "HEAL":"细颗粒物(PM2.5)，比可吸入颗粒物(PM10)更易吸附有毒害的物质。如重金属(在城市中以重金属元素最为严重，较突出的有Zn、Pb、As、Cd等，而不同地区也有着各自的特点)、有毒微生物等。由于体积更小，PM2.5具有更强的穿透力，可能抵达细支气管壁，并干扰肺内的气体交换。更小的微粒(直径小于等于100纳米)会通过肺部传递影响其他器官。PM2.5会导致动脉斑块沉积，引发血管炎症和动脉粥样硬化，最终导致心脏病或其他心血管问题。这项始于1982年的研究证实，当空气中PM2.5的浓度长期高于10μg/m³，就会带来死亡风险的上升。浓度每增加10μg/m³，总的死亡风险会上升4%，心肺疾病带来的死亡风险上升6%，肺癌带来的死亡风险上升8%。此外，PM2.5极易吸附多环芳烃等有机污染物和重金属，使致癌、致畸、致突变的几率明显升高。中国科学院陈竺院士等研究者，于《柳叶刀》杂志上发表的文章中估计中国每年因室外空气污染导致的早死人数在35万-50万人之间。"},
     "KMnO4":{"NAME":"高锰酸盐指数","RES":"",
        "DW":"24小时均值(μg/m³)","level1":"0","level2":"2","level3":"4","level4":"6","level5":"10","level6":"15","level7":"25",
        "HEAL":""},
     "Px":{"NAME":"总磷","RES":"",
        "DW":"24小时均值(μg/m³)","level1":"0","level2":"0.02","level3":"0.1","level4":"0.2","level5":"0.3","level6":"0.4","level7":"0.6",
        "HEAL":""},
     "NH":{"NAME":"氨氮","RES":"",
        "DW":"24小时均值(μg/m³)","level1":"0","level2":"0.15","level3":"0.5","level4":"1.0","level5":"1.5","level6":"2.0","level7":"3.0",
        "HEAL":""},
     "O2":{"NAME":"溶解氧","RES":"",
        "DW":"24小时均值(μg/m³)","level1":"25","level2":"7.5","level3":"6","level4":"5","level5":"3","level6":"2","level7":"0",
        "HEAL":""},
    "PM10":{"NAME":"可吸入颗粒物PM<sub>10</sub>","RES":"主要的来源是建筑活动和从地表氧气的尘土，含有氧化物矿物和其他成分，海盐是颗粒物的第二大来源，其组成与海水的成分累死。部分颗粒物是自然过程产生的，源自火山爆发、沙尘暴、森林火灾、浪花等。",
        "DW":"24小时均值(μg/m³)","level1":"0~50","level2":"51~150","level3":"151~250","level4":"251~350","level5":"351~420","level6":">420",
        "HEAL":"可吸入颗粒物(PM10)对人的影响要大于其他任何污染物，颗粒物的大小决定了它们最终在呼吸道中的位置。较大的颗粒物往往会被纤毛和粘液过滤，无法通过鼻子和咽喉。然而，小于10微米的颗粒物即可吸入颗粒物，可以穿透这些屏障达到支气管和肺泡。长期暴露于这些颗粒物可能导致罹患心血管和呼吸道疾病以及肺癌。"}

}

var graphColor=['#ff7f50', '#87cefa', '#da70d6', '#32cd32', '#6495ed',
    '#ff69b4', '#ba55d3', '#cd5c5c', '#ffa500', '#40e0d0',
    '#1e90ff', '#ff6347', '#7b68ee', '#00fa9a', '#ffd700',
    '#6b8e23', '#ff00ff', '#3cb371', '#b8860b', '#30e0e0'];


var auditGraphDataForSaveCity=[]
var auditGraphDataForSaveCounty=[]
var cityStationName=[];
var countyStationName=[];
var auditTableDataForSaveCity=[]
var auditTableDataForSaveCounty=[]